Catalogs/Игроки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Игроки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Команды</xr:Item>
				<xr:Item>Catalog.Страны</xr:Item>
				<xr:Item>Catalog.Города</xr:Item>
				<xr:Item>Catalog.Амплуа</xr:Item>
				<xr:Item>Catalog.Чемпионаты</xr:Item>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Итоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>Итоги</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОчков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЗабито</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПропущено</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоГолов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПеремещенияИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПеремещенияИгроков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амплуа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Амплуа</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Игроки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Чемпионаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Чемпионаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Лига</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.Лига</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Команды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Игроки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Изображение	= ИзображениеПолучить(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка);
КонецФункции

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога();
КонецФункции

&НаКлиенте
Процедура ВыбратьИзображение(Команда)
	Если СтрСравнить(Команда.Имя, "ВыбратьИзображение") = 0 Тогда
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект),,,, ПараметрыДиалога());
	ИначеЕсли СтрСравнить(Команда.Имя, "УдалитьИзображение") = 0 Тогда
		Изображение = ИзображениеДефолтПолучить();
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеДефолтПолучить()
	Возврат СерверныйФункции.ИзображениеДефолтПолучить();
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(Результат.СсылкаНаФайл.Расширение)
		И Результат.СсылкаНаФайл.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный()
		Тогда
			Изображение = Результат.Адрес;
			Модифицированность	= Истина;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Данный тип файла не поддерживается");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") И НЕ ПустаяСтрока(Результат) Тогда
		Данные				= Новый ДвоичныеДанные(Результат);
		Если Данные.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный() Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		СерверныйФункции.ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Изображение, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент=Неопределено)
	Возраст = Возраст(Объект.ДатаРождения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаРожденияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ЭтоУРЛ(ПараметрыПеретаскивания.Значение) Тогда
		НачатьКопированиеФайла(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект), ПараметрыПеретаскивания.Значение, СерверныйФункции.КаталогаФайлов() + ИмяФайла(ПараметрыПеретаскивания.Значение));
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(ПараметрыПеретаскивания.Значение.Расширение) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя), УникальныйИдентификатор);
			Модифицированность	= Истина;
			СтандартнаяОбработка= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НаКлиенте.Оповещение("Игрок", Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИгрока(Игрок)
	Возврат СерверныйФункции.ДанныеИгрока(Игрок);
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеИгрока	= ДанныеИгрока(ТекущийОбъект.Ссылка);
	ТекущаяКоманда	= ДанныеИгрока.Команда;
	ТекущийНомер	= ДанныеИгрока.Номер;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Год(ТекущаяДатаСеанса()) - Год(Объект.ДатаРождения) < 15 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Дата неверна", Отказ, Объект.Ссылка, "Объект.ДатаРождения");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧемпионыПолучить(Игрок)
	Рисунки = Новый Массив;
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Чемпионаты.Владелец КАК Ссылка,
	      	               |	Чемпионаты.Владелец.Код КАК Код,
	      	               |	Чемпионаты.Владелец.Наименование КАК Наименование,
	      	               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
	      	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
	      	               |	Чемпионаты.ДатаОкончания КАК Период,
	      	               |	Итоги.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрСведений.Итоги КАК Итоги
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	      	               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
	      	               |		ПО Итоги.Команда = ПеремещенияИгроков.Команда
	      	               |			И (КОНЕЦПЕРИОДА(Итоги.Период, ГОД) >= ПеремещенияИгроков.Период)
	      	               |ГДЕ
	      	               |	Итоги.Место = 1
	      	               |	И ПеремещенияИгроков.Игрок = &Игрок
	      	               |	И ПеремещенияИгроков.Период < Чемпионаты.ДатаОкончания
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЕстьКартинка УБЫВ,
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Игрок",			Игрок);
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор	= Новый Структура("Игрок", Игрок);
	Пока Выборка.Следующий() Цикл
		Перемещение = РегистрыСведений.ПеремещенияИгроков.ПолучитьПоследнее(Выборка.Период, Отбор);
		Если Перемещение.Команда = Выборка.Команда Тогда
			Элемент = Новый Структура("Ссылка,Код,Наименование,ЕстьКартинка,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, Выборка);
			Если Выборка.ЕстьКартинка Тогда
				Элемент.Представление	= ИзображениеПолучить(Выборка.Ссылка);
			КонецЕсли;
			Рисунки.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Рисунки;
КонецФункции

&НаСервере
Процедура ЭлементыОчистить()
	Пока Элементы.ГруппаЧемпионы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		Элементы.Удалить(Элементы.ГруппаЧемпионы.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЧемпионыОбновитьНаСервере()
	Чемпионы.Очистить();
	ЭлементыОчистить();
	
	Лиги	= Новый Соответствие;
	Список	= ЧемпионыПолучить(Объект.Ссылка);
	Для Каждого Чемпион Из Список Цикл
		Количество = Лиги.Получить(Чемпион.Ссылка);
		Если Количество = Неопределено Тогда
			Лиги.Вставить(Чемпион.Ссылка, 1);
			ЭлементСписка = Чемпионы.Добавить(Чемпион.Ссылка, Чемпион.Представление);
			
			Элемент = Элементы.Добавить("Декорация" + Чемпион.Код, Тип("ПолеФормы"), Элементы.ГруппаЧемпионы);
			Если Чемпион.ЕстьКартинка Тогда
				Элемент.Вид			= ВидПоляФормы.ПолеКартинки;
				Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Представление", Чемпионы.Количество() - 1);
				Элемент.Заголовок	= СтрШаблон("%1 (%2)", Чемпион.Наименование, 1);
			Иначе
				Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Значение", Чемпионы.Количество() - 1);
				Элемент.Заголовок	= СтрШаблон("(%1)", 1);
			КонецЕсли;
			Элемент.АвтоМаксимальнаяВысота	= Ложь;
			Элемент.МаксимальнаяВысота		= 8;
			Элемент.АвтоМаксимальнаяШирина	= Ложь;
			Элемент.МаксимальнаяШирина		= 20;
			Элемент.Подсказка	= Чемпион.Представление;
			Элемент.РасширеннаяПодсказка.Заголовок = Чемпион.Ссылка;
			Элемент.Гиперссылка		= Истина;
			Элемент.ТолькоПросмотр	= Истина;
			Элемент.УстановитьДействие("Нажатие", "ДекорацияНажатие");
		Иначе
			Количество = Количество + 1;
			Лиги.Вставить(Чемпион.Ссылка, Количество);
			
			Элемент = Элементы.Найти("Декорация" + Чемпион.Код);
			Если Чемпион.ЕстьКартинка Тогда
				Элемент.Заголовок	= СтрШаблон("%1 (%2)", Чемпион.Наименование, Количество);
			Иначе
				Элемент.Заголовок	= СтрШаблон("(%1)", Количество);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТрофеиОбновить(Команда)
	ЧемпионыОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.СтраницаТрофеи = ТекущаяСтраница Тогда
		Если Чемпионы.Количество() = 0 Тогда
			ЧемпионыОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
